var listening_array = [
	["A", "这是王老师，这是我爸爸。", "Zhè shì wáng lǎoshī, zhè shì wǒ bàba."],
	["B", "王老师，您好！", "Wáng lǎoshī, nín hǎo!"],
	["C", "您好！请进！请坐！请喝茶！", "Nín hǎo! Qǐng jìn! Qǐng zuò! Qǐng hē chá!"],
	["B", "谢谢！", "Xièxiè!"],
	["C", "不客气！", "Bù kèqì!"],
	["C", "工作忙吗？", "Gōngzuò máng ma?"],
	["B", "不太忙。", "Bù tài máng."],
	["C", "身体好吗？", "Shēntǐ hǎo ma?"],
	["B", "很好！", "Hěn hǎo!"]
];

var vocabulary_array = [
	['1.', '这', '代', 'zhè', 'đây này'],
    ['2.', '是', '动', 'shì', 'là'],
    ['3.', '老师', '名', 'lǎoshī', 'thầy giáo'],
    ['4.', '您', '代', 'nín', 'ngài'],
    ['5.', '请', '动', 'qǐng', 'thứ ba'],
    ['6.', '进', '动', 'jìn', 'vào'],
    ['7.', '坐', '动', 'zuò', 'ngồi'],
    ['8.', '喝', '动', 'hē', 'uống'],
    ['9.', '茶', '名', 'chá', 'trà'],
    ['10.', '谢谢', '动', 'xièxiè', 'cảm ơn'],
    ['11.', '不客气', '', 'bù kèqì', 'không có gì'],
    ['12.', '客气', '动', 'kèqì', 'khách khí, lịch sự'],
    ['13.', '工作', '名, 动', 'gōngzuò', 'công việc, công tác'],
    ['14.', '身体', '名', 'shēntǐ', 'sức khoẻ, thân thể'],
    ['15.', '十', '数', 'shí', 'mười'],
    ['16.', '日', '名', 'rì', 'ngày']
];

var name_array = [
	["王", "wáng", "Họ Vương"]
];
