var initial_01_array = [
	[
		[50, 'b'], [50, 'p'], [50, 'm'], [50, 'f'], [50, 'd'], [50, 't'], [50, 'n'], [50, 'l'], [50, 'g'], [50, 'k'], [50, 'h']
	]
];

var final_01_array = [
	[
		[50, 'a'], [50, 'o'], [50, 'e'], [50, 'i'], [50, 'u'], [50, 'ü'], [50, 'ai'], [50, 'ei'], [50, 'ao'], [50, 'ou']
	]
];

var combination_01_array = [
	[
		[50, 'ba'], [50, 'bo'], [50, '&nbsp;'], [50, 'bi'], [50, 'bu'], [50, '&nbsp;'], [50, 'bai'], [50, 'bei'], [50, 'bao'], [50, '&nbsp;']
	],
	[
		[50, 'pa'], [50, 'po'], [50, '&nbsp;'], [50, 'pi'], [50, 'pu'], [50, '&nbsp;'], [50, 'pai'], [50, 'pei'], [50, 'pao'], [50, 'pou']
	],
	[
		[50, 'ma'], [50, 'mo'], [50, 'me'], [50, 'mi'], [50, 'mu'], [50, '&nbsp;'], [50, 'mai'], [50, 'mei'], [50, 'mao'], [50, 'mou']
	],
	[
		[50, 'fa'], [50, 'fo'], [50, '&nbsp;'], [50, '&nbsp;'], [50, 'fu'], [50, '&nbsp;'], [50, '&nbsp;'], [50, 'fei'], [50, '&nbsp;'], [50, 'fou']
	],
	[
		[50, 'da'], [50, '&nbsp;'], [50, 'de'], [50, 'di'], [50, 'du'], [50, '&nbsp;'], [50, 'dai'], [50, 'dei'], [50, 'dao'], [50, 'dou']
	],
	[
		[50, 'ta'], [50, '&nbsp;'], [50, 'te'], [50, 'ti'], [50, 'tu'], [50, '&nbsp;'], [50, 'tai'], [50, '&nbsp;'], [50, 'tao'], [50, 'tou']
	],
	[
		[50, 'na'], [50, '&nbsp;'], [50, 'ne'], [50, 'ni'], [50, 'nu'], [50, 'nü'], [50, 'nai'], [50, 'nei'], [50, 'nao'], [50, 'nou']
	],
	[
		[50, 'la'], [50, '&nbsp;'], [50, 'le'], [50, 'li'], [50, 'lu'], [50, 'lü'], [50, 'lai'], [50, 'lei'], [50, 'lao'], [50, 'lou']
	],
	[
		[50, 'ga'], [50, '&nbsp;'], [50, 'ge'], [50, '&nbsp;'], [50, 'gu'], [50, '&nbsp;'], [50, 'gai'], [50, 'gei'], [50, 'gao'], [50, 'gou']
	],
	[
		[50, 'ka'], [50, '&nbsp;'], [50, 'ke'], [50, '&nbsp;'], [50, 'ku'], [50, '&nbsp;'], [50, 'kai'], [50, 'kei'], [50, 'kao'], [50, 'kou']
	],
	[
		[50, 'ha'], [50, '&nbsp;'], [50, 'he'], [50, '&nbsp;'], [50, 'hu'], [50, '&nbsp;'], [50, 'hai'], [50, 'hei'], [50, 'hao'], [50, 'hou']
	],
	[
		[50, '&nbsp;'], [50, '&nbsp;'], [50, '&nbsp;'], [50, 'yi'], [50, 'wu'], [50, 'yu'], [50, '&nbsp;'], [50, '&nbsp;'], [50, '&nbsp;'], [50, '&nbsp;']
	],
];

var final_02_array = [
	[
		[50, 'an'], [50, 'en'], [50, 'ang'], [50, 'eng'], [50, 'ong']
	]
];

var combination_02_array = [
	[
		[50, 'ban'], [50, 'ben'], [50, 'bang'], [50, 'beng'], [50, '&nbsp;']
	],
	[
		[50, 'pan'], [50, 'pen'], [50, 'pang'], [50, 'peng'], [50, '&nbsp;']
	],
	[
		[50, 'man'], [50, 'men'], [50, 'mang'], [50, 'meng'], [50, '&nbsp;']
	],
	[
		[50, 'fan'], [50, 'fen'], [50, 'fang'], [50, 'feng'], [50, '&nbsp;']
	],
	[
		[50, 'dan'], [50, 'den'], [50, 'dang'], [50, 'deng'], [50, 'dong']
	],
	[
		[50, 'tan'], [50, '&nbsp;'], [50, 'tang'], [50, 'teng'], [50, 'tong']
	],
	[
		[50, 'nan'], [50, 'nen'], [50, 'nang'], [50, 'neng'], [50, 'nong']
	],
	[
		[50, 'lan'], [50, '&nbsp;'], [50, 'lang'], [50, 'leng'], [50, 'long']
	],
	[
		[50, 'gan'], [50, 'gen'], [50, 'gang'], [50, 'geng'], [50, 'gong']
	],
	[
		[50, 'kan'], [50, 'ken'], [50, 'kang'], [50, 'keng'], [50, 'kong']
	],
	[
		[50, 'han'], [50, 'hen'], [50, 'hang'], [50, 'heng'], [50, 'hong']
	]
];

var initial_03_array = [
	[
		[50, 'j'], [50, 'q'], [50, 'x']
	]
];

var final_03_array = [
	[
		[50, 'ia'], [50, 'ie'], [50, 'iao'], [50, 'iu'], [50, 'ian'], [50, 'in'], [50, 'iang'], [50, 'ing'], [50, 'ü'], [50, 'üe'], [50, 'üan'], [50, 'ün'], [50, 'iong']
	]
];

var combination_03a_array = [
	[
		[50, 'ji'], [50, 'jia'], [50, 'jie'], [50, 'jiao'], [50, 'jiu'], [50, 'jian'], [50, 'jin'], [50, 'jiang'], [50, 'jing'], [50, 'jiong']
	],
	[
		[50, 'qi'], [50, 'qia'], [50, 'qie'], [50, 'qiao'], [50, 'qiu'], [50, 'qian'], [50, 'qin'], [50, 'qiang'], [50, 'qing'], [50, 'qiong']
	],
	[
		[50, 'xi'], [50, 'xia'], [50, 'xie'], [50, 'xiao'], [50, 'xiu'], [50, 'xian'], [50, 'xin'], [50, 'xiang'], [50, 'xing'], [50, 'xiong']
	],
	[
		[50, 'bi'], [50, '&nbsp;'], [50, 'bie'], [50, 'biao'], [50, '&nbsp;'], [50, 'bian'], [50, 'bin'], [50, '&nbsp;'], [50, 'bing'], [50, '&nbsp;']
	],
	[
		[50, 'pi'], [50, '&nbsp;'], [50, 'pie'], [50, 'piao'], [50, '&nbsp;'], [50, 'pian'], [50, 'pin'], [50, '&nbsp;'], [50, 'ping'], [50, '&nbsp;']
	],
	[
		[50, 'mi'], [50, '&nbsp;'], [50, 'mie'], [50, 'miao'], [50, '&nbsp;'], [50, 'mian'], [50, 'min'], [50, '&nbsp;'], [50, 'ming'], [50, '&nbsp;']
	],
	[
		[50, 'di'], [50, '&nbsp;'], [50, 'die'], [50, 'diao'], [50, 'diu'], [50, 'dian'], [50, '&nbsp;'], [50, '&nbsp;'], [50, 'ding'], [50, '&nbsp;']
	],
	[
		[50, 'ti'], [50, '&nbsp;'], [50, 'tie'], [50, 'tiao'], [50, '&nbsp;'], [50, 'tian'], [50, '&nbsp;'], [50, '&nbsp;'], [50, 'ting'], [50, '&nbsp;']
	],
	[
		[50, 'ni'], [50, '&nbsp;'], [50, 'nie'], [50, 'niao'], [50, 'niu'], [50, 'nian'], [50, 'nin'], [50, 'niang'], [50, 'ning'], [50, '&nbsp;']
	],
	[
		[50, 'li'], [50, 'lia'], [50, 'lie'], [50, 'liao'], [50, 'liu'], [50, 'lian'], [50, 'lin'], [50, 'liang'], [50, 'ling'], [50, '&nbsp;']
	],
	[
		[50, 'yi'], [50, 'ya'], [50, 'ye'], [50, 'yao'], [50, 'you'], [50, 'yan'], [50, 'yin'], [50, 'yang'], [50, 'ying'], [50, 'yong']
	]
];

var combination_03b_array = [
	[
		[50, 'nü'], [50, 'nüe'], [50, '&nbsp;'], [50, '&nbsp;']
	],
	[
		[50, 'lü'], [50, 'lüe'], [50, '&nbsp;'], [50, '&nbsp;']
	],
	[
		[50, 'ju'], [50, 'jue'], [50, 'juan'], [50, 'jun']
	],
	[
		[50, 'qu'], [50, 'que'], [50, 'quan'], [50, 'qun']
	],
	[
		[50, 'xu'], [50, 'xue'], [50, 'xuan'], [50, 'xun']
	],
	[
		[50, 'yu'], [50, 'yue'], [50, 'yuan'], [50, 'yun']
	]
];

var initial_04_array = [
	[
		[50, 'z'], [50, 'c'], [50, 's']
	]
];

var final_04_array = [
	[
		[50, 'i'], [50, 'er'], [50, 'ua'], [50, 'uo'], [50, 'uai'], [50, 'ui'], [50, 'uan'], [50, 'un'], [50, 'uang'], [50, 'ueng']
	]
];

var combination_04a_array = [
	[
		[50, 'za'], [50, 'ze'], [50, 'zi'], [50, 'zai'], [50, 'zei'], [50, 'zao'], [50, 'zou'], [50, 'zan'], [50, 'zen'], [50, 'zang'], [50, 'zeng'], [50, 'zong']
	],
	[
		[50, 'ca'], [50, 'ce'], [50, 'ci'], [50, 'cai'], [50, '&nbsp;'], [50, 'cao'], [50, 'cou'], [50, 'can'], [50, 'cen'], [50, 'cang'], [50, 'ceng'], [50, 'cong']
	],
	[
		[50, 'sa'], [50, 'se'], [50, 'si'], [50, 'sai'], [50, '&nbsp;'], [50, 'sao'], [50, 'sou'], [50, 'san'], [50, 'sen'], [50, 'sang'], [50, 'seng'], [50, 'song']
	]
];

var combination_04b_array = [
	[
		[50, 'zu'], [50, 'zuo'], [50, 'zui'], [50, 'zuan'], [50, 'zun']
	],
	[
		[50, 'cu'], [50, 'cuo'], [50, 'cui'], [50, 'cuan'], [50, 'cun']
	],
	[
		[50, 'su'], [50, 'suo'], [50, 'sui'], [50, 'suan'], [50, 'sun']
	]
];

var combination_04c_array = [
	[
		[50, '&nbsp;'], [50, 'duo'], [50, '&nbsp;'], [50, 'dui'], [50, 'duan'], [50, 'dun'], [50, '&nbsp;']
	],
	[
		[50, '&nbsp;'], [50, 'tuo'], [50, '&nbsp;'], [50, 'tui'], [50, 'tuan'], [50, 'tun'], [50, '&nbsp;']
	],
	[
		[50, '&nbsp;'], [50, 'nuo'], [50, '&nbsp;'], [50, '&nbsp;'], [50, 'nuan'], [50, '&nbsp;'], [50, '&nbsp;']
	],
	[
		[50, '&nbsp;'], [50, 'luo'], [50, '&nbsp;'], [50, '&nbsp;'], [50, 'luan'], [50, 'lun'], [50, '&nbsp;']
	],
	[
		[50, 'gua'], [50, 'guo'], [50, 'guai'], [50, 'gui'], [50, 'guan'], [50, 'gun'], [50, 'guang']
	],
	[
		[50, 'kua'], [50, 'kuo'], [50, 'kuai'], [50, 'kui'], [50, 'kuan'], [50, 'kun'], [50, 'kuang']
	],
	[
		[50, 'hua'], [50, 'huo'], [50, 'huai'], [50, 'hui'], [50, 'huan'], [50, 'hun'], [50, 'huang']
	],
	[
		[50, 'wa'], [50, 'wo'], [50, 'wai'], [50, 'wei'], [50, 'wan'], [50, 'wen'], [50, 'wang']
	]
];

var initial_05_array = [
	[
		[50, 'zh'], [50, 'ch'], [50, 'sh'], [50, 'r']
	]
];

var final_05_array = [
	[
		[50, 'i']
	]
];

var combination_05a_array = [
	[
		[50, 'zha'], [50, 'zhe'], [50, 'zhi'], [50, 'zhai'], [50, 'zhei'], [50, 'zhao'], [50, 'zhou']
	],
	[
		[50, 'cha'], [50, 'che'], [50, 'chi'], [50, 'chai'], [50, '&nbsp;'], [50, 'chao'], [50, 'chou']
	],
	[
		[50, 'sha'], [50, 'she'], [50, 'shi'], [50, 'shai'], [50, 'shei'], [50, 'shao'], [50, 'shou']
	],
	[
		[50, '&nbsp;'], [50, 're'], [50, 'ri'], [50, '&nbsp;'], [50, '&nbsp;'], [50, 'rao'], [50, 'rou']
	]
];

var combination_05b_array = [
	[
		[50, 'zhan'], [50, 'zhen'], [50, 'zhang'], [50, 'zheng'], [50, 'zhong']
	],
	[
		[50, 'chan'], [50, 'chen'], [50, 'chang'], [50, 'cheng'], [50, 'chong']
	],
	[
		[50, 'shan'], [50, 'shen'], [50, 'shang'], [50, 'sheng'], [50, '&nbsp;']
	],
	[
		[50, 'ran'], [50, 'ren'], [50, 'rang'], [50, 'reng'], [50, 'rong']
	]
];

var combination_05c_array = [
	[
		[50, 'zhu'], [50, 'zhua'], [50, 'zhuo'], [50, 'zhuai'], [50, 'zhui'], [50, 'zhuan'], [50, 'zhun'], [50, 'zhuang']
	],
	[
		[50, 'chu'], [50, 'chua'], [50, 'chuo'], [50, 'chuai'], [50, 'chui'], [50, 'chuan'], [50, 'chun'], [50, 'chuang']
	],
	[
		[50, 'shu'], [50, 'shua'], [50, 'shuo'], [50, 'shuai'], [50, 'shui'], [50, 'shuan'], [50, 'shun'], [50, 'shuang']
	],
	[
		[50, 'ru'], [50, 'rua'], [50, 'ruo'], [50, '&nbsp;'], [50, 'rui'], [50, 'ruan'], [50, 'run'], [50, '&nbsp;']
	]
];
