var listening_array = [
	["（一）你去哪儿"],
	["A", "今天星期几？", "Jīntiān xīngqí jǐ?"],
	["B", "今天星期二。", "Jīntiān xīngqí'èr."],
	["A", "你去哪儿？", "Nǐ qù nǎ'er?"],
	["B", "我去天安门，你去不去？", "Wǒ qù tiān'ānmén, nǐ qù bù qù?"],
	["A", "不去，我回学校。", "Bù qù, wǒ huí xuéxiào."],
	["B", "再见！", "Zàijiàn!"],
	["A", "再见！", "Zàijiàn!"],
	["（二）对不起"],
	["A", "对不起！", "Duìbùqǐ!"],
	["B", "没关系！", "Méiguānxì!"]
];

var vocabulary_array = [
	['1.', '今天', '名', 'jīntiān', 'hôm nay'],
    ['', '天', '名', 'tiān', 'ngày'],
    ['', '昨天', '名', 'zuótiān', 'hôm qua'],
    ['2.', '星期', '名', 'xīngqí', 'tuần'],
    ['', '星期一', '名', 'xīngqí yī', 'thứ hai'],
    ['', '星期二', '名', 'xīngqí\'èr', 'thứ ba'],
    ['', '星期三', '名', 'xīngqísān', 'thứ tư'],
    ['', '星期四', '名', 'xīngqísì', 'thứ năm'],
    ['', '星期五', '名', 'xīngqíwǔ', 'thứ sáu'],
    ['', '星期六', '名', 'xīngqíliù', 'thứ bảy'],
    ['', '星期天', '名', 'xīngqítiān', 'chủ nhật'],
    ['3.', '几', '代', 'jǐ', 'mấy, vài'],
    ['4.', '二', '数', 'èr', 'hai'],
    ['5.', '三', '数', 'sān', 'ba'],
    ['6.', '四', '数', 'sì', 'bốn'],
    ['7.', '哪儿', '代', 'nǎ\'er', 'ở đâu'],
    ['8.', '那儿', '代', 'nà\'er', 'ở đó, nơi đó, chổ kia'],
    ['9.', '我', '代', 'wǒ', 'tôi, tao, ta ...'],
    ['10.', '回', '动', 'huí', 'về, trở về, quay về'],
    ['11.', '学校', '名', 'xuéxiào', 'trường học'],
    ['12.', '再见', '动', 'zàijiàn', 'tạm biệt'],
    ['13.', '对不起', '', 'duìbùqǐ', 'xin lỗi'],
    ['14.', '没关系', '', 'méiguānxì', 'không có gì']
];

var name_array = [
	["天安门", "tiān'ānmén", "Thiên An Môn"]
];
