var listening_array = [
	["A", "你忙吗？", "Nǐ máng ma?"],
	["B", "很忙。", "Hěn máng."],
	["A", "汉语难吗？", "Hànyǔ nán ma?"],
	["B", "不太难。", "Bù tài nán."]
];

var vocabulary_array = [
	['1.', '忙', '形', 'máng', 'bận'],
    ['2.', '吗', '助', 'ma', 'trợ từ nghi vấn'],
    ['3.', '很', '副', 'hěn', 'rất'],
    ['4.', '汉语', '名', 'hànyǔ', 'tiếng hoa'],
    ['5.', '难', '形', 'nán', 'khó'],
    ['6.', '太', '副', 'tài', 'hơi, quá, lắm'],
    ['7.', '爸爸', '名', 'bàba', 'bố, ba'],
    ['8.', '妈妈', '名', 'māmā', 'mẹ, má'],
    ['9.', '他', '代', 'tā', 'anh ta, ông ta'],
    ['10.', '她', '代', 'tā', 'cô ta, bà ta'],
    ['11.', '男', '形', 'nán', 'nam giới, con trai'],
    ['12.', '哥哥', '名', 'gēgē', 'anh trai'],
    ['13.', '弟弟', '名', 'dìdi', 'em trai'],
    ['14.', '妹妹', '名', 'mèimei', 'em gái']
];
