var abbreviation_array = [
	[
		[30, "1."], [75, "名词"], [150, "míngcí"], [50, "( 名 )"], ["200 vietnamese", "danh từ"]
	],
	[
		[30, "2."], [75, "代词"], [150, "dàicí"], [50, "( 代 )"], ["200 vietnamese", "đại từ"]
	],
	[
		[30, "3."], [75, "动词"], [150, "dòngcí"], [50, "( 动 )"], ["200 vietnamese", "động từ"]
	],
	[
		[30, "&nbsp;"], [75, "离合词"], [150, "líhécí"], [50, "( 离合 )"], ["200 vietnamese", "động từ ly hợp"]
	],
	[
		[30, "4."], [75, "形容词"], [150, "xíngróngcí"], [50, "( 形 )"], ["200 vietnamese", "tính từ (hình dung từ)"]
	],
	[
		[30, "5."], [75, "数词"], [150, "shùcí"], [50, "( 数 )"], ["200 vietnamese", "số từ"]
	],
	[
		[30, "6."], [75, "量词"], [150, "liàngcí"], [50, "( 量 )"], ["200 vietnamese", "lượng từ"]
	],
	[
		[30, "&nbsp;"], [75, "数量词"], [150, "shùliàngcí"], [50, "( 数量 )"], ["200 vietnamese", "số lượng từ"]
	],
	[
		[30, "7."], [75, "副词"], [150, "fùcí"], [50, "( 副 )"], ["200 vietnamese", "phó từ"]
	],
	[
		[30, "8."], [75, "介词"], [150, "jiècí"], [50, "( 介 )"], ["200 vietnamese", "giới từ"]
	],
	[
		[30, "9."], [75, "连词"], [150, "liáncí"], [50, "( 连 )"], ["200 vietnamese", "liên từ"]
	],
	[
		[30, "10."], [75, "助词"], [150, "zhùcí"], [50, "( 助 )"], ["200 vietnamese", "trợ từ"]
	],
	[
		[30, "&nbsp;"], [75, "动泰助词"], [150, "dòngtài zhùcí"], [50, "&nbsp;"], ["200 vietnamese", "trợ từ động thái"]
	],
	[
		[30, "&nbsp;"], [75, "结构助词"], [150, "jiégòu zhùcí"], [50, "&nbsp;"], ["200 vietnamese", "trợ từ kết cấu"]
	],
	[
		[30, "&nbsp;"], [75, "语气助词"], [150, "yǔqì zhùcí"], [50, "&nbsp;"], ["200 vietnamese", "trợ từ ngữ khí"]
	],
	[
		[30, "11."], [75, "叹词"], [150, "tàncí"], [50, "叹"], ["200 vietnamese", "thán từ"]
	],
	[
		[30, "12."], [75, "象声词"], [150, "xiàngshēngcí"], [50, "象"], ["200 vietnamese", "từ tượng thanh"]
	],
	[
		[30, "13."], [75, "词头"], [150, "cítóu"], [50, "头"], ["200 vietnamese", "tiền tố"]
	],
	[
		[30, "14."], [75, "词尾"], [150, "cíwěi"], [50, "尾"], ["200 vietnamese", "hậu tố"]
	]
];
