var listening_array = [
	["A", "你好!", "Nǐ hǎo!", "Xin chào!"],
	["B", "你好!", "Nǐ hǎo!", "Xin chào!"]
];

var vocabulary_array = [
    ['1.', '你', '代', 'nǐ', 'anh, chị, bạn, ông, bà ...'],
    ['2.', '好', '形', 'hǎo', 'tốt, đẹp, hay, ngon ...'],
    ['', '你好', '', 'nǐ hǎo', 'xin chào'],
    ['3.', '一', '数', 'yī', 'một'],
    ['4.', '五', '数', 'wǔ', 'năm'],
    ['5.', '八', '数', 'bā', 'tám'],
    ['6.', '大', '形', 'dà', 'to, lớn'],
    ['7.', '不', '副', 'bù', 'không, chẳng'],
    ['8.', '口', '名 , 量', 'kǒu', 'miệng, nhân khẩu'],
    ['9.', '白', '形', 'bái', 'màu trắng'],
    ['10.', '女', '形', 'nǚ', 'nữ, phụ nữ'],
    ['11.', '马', '名', 'mǎ', 'con ngựa']
];
