var abbreviation_array = [
	[
		[20, "1."], [75, "名词"], [100, "míngcí"], [50, "( 名 )"], ["100 vietnamese", "danh từ"]
	],
	[
		[20, "2."], [75, "代词"], [100, "dàicí"], [50, "( 代 )"], ["100 vietnamese", "đại từ"]
	],
	[
		[20, "3."], [75, "动词"], [100, "dòngcí"], [50, "( 动 )"], ["100 vietnamese", "động từ"]
	],
	[
		[20, "&nbsp;"], [75, "离合词"], [100, "líhécí"], [50, "( 离合 )"], ["100 vietnamese", "động từ ly hợp"]
	],
	[
		[20, "4."], [75, "形容词"], [100, "xíngróngcí"], [50, "( 形 )"], ["100 vietnamese", "tính từ (hình dung từ)"]
	],
	[
		[20, "5."], [75, "数词"], [100, "shùcí"], [50, "( 数 )"], ["100 vietnamese", "số từ"]
	],
	[
		[20, "6."], [75, "量词"], [100, "liàngcí"], [50, "( 量 )"], ["100 vietnamese", "lượng từ"]
	],
	[
		[20, "&nbsp;"], [75, "数量词"], [100, "shùliàngcí"], [50, "( 数量 )"], ["100 vietnamese", "số lượng từ"]
	],
	[
		[20, "7."], [75, "副词"], [100, "fùcí"], [50, "( 副 )"], ["100 vietnamese", "phó từ"]
	],
	[
		[20, "8."], [75, "介词"], [100, "jiècí"], [50, "( 介 )"], ["100 vietnamese", "giới từ"]
	],
	[
		[20, "9."], [75, "连词"], [100, "liáncí"], [50, "( 连 )"], ["100 vietnamese", "liên từ"]
	],
	[
		[20, "10."], [75, "助词"], [100, "zhùcí"], [50, "( 助 )"], ["100 vietnamese", "trợ từ"]
	],
	[
		[20, "&nbsp;"], [75, "动泰助词"], [100, "dòngtài zhùcí"], [50, "&nbsp;"], ["100 vietnamese", "trợ từ động thái"]
	],
	[
		[20, "&nbsp;"], [75, "结构助词"], [100, "jiégòu zhùcí"], [50, "&nbsp;"], ["100 vietnamese", "trợ từ kết cấu"]
	],
	[
		[20, "&nbsp;"], [75, "语气助词"], [100, "yǔqì zhùcí"], [50, "&nbsp;"], ["100 vietnamese", "trợ từ ngữ khí"]
	],
	[
		[20, "11."], [75, "叹词"], [100, "tàncí"], [50, "叹"], ["100 vietnamese", "thán từ"]
	],
	[
		[20, "12."], [75, "象声词"], [100, "xiàngshēngcí"], [50, "象"], ["100 vietnamese", "từ tượng thanh"]
	],
	[
		[20, "13."], [75, "词头"], [100, "cítóu"], [50, "头"], ["100 vietnamese", "tiền tố"]
	],
	[
		[20, "14."], [75, "词尾"], [100, "cíwěi"], [50, "尾"], ["100 vietnamese", "hậu tố"]
	]
];
